---
kind: type
id: T:Autodesk.Revit.DB.Macros.IEntryPoint
source: html/b12791d1-81ab-b326-2bc7-da785d78e1fc.htm
---
# Autodesk.Revit.DB.Macros.IEntryPoint

The interface supporting Document and Application level entry point classes for macros.

## Syntax (C#)
```csharp
public interface IEntryPoint
```